adafruit/Adafruit_nRF52_Arduino/libraries/Bluefruit52Lib/src/bluefruit.cpp
            #ifdef NRF52840_XXAA
            /*------------- usb power event handler -------------*/
            case NRF_EVT_POWER_USB_DETECTED:
            case NRF_EVT_POWER_USB_POWER_READY:
            case NRF_EVT_POWER_USB_REMOVED:
            {
              int32_t usbevt = (soc_evt == NRF_EVT_POWER_USB_DETECTED   ) ? NRFX_POWER_USB_EVT_DETECTED:
                               (soc_evt == NRF_EVT_POWER_USB_POWER_READY) ? NRFX_POWER_USB_EVT_READY   :
                               (soc_evt == NRF_EVT_POWER_USB_REMOVED    ) ? NRFX_POWER_USB_EVT_REMOVED : -1;

              if ( usbevt >= 0) tusb_hal_nrf_power_event(usbevt);
            }
            break;
            #endif

            default: break;
          }
        }
      }
    }
  }
}

/*------------------------------------------------------------------*/
/* BLE Event handler
 *------------------------------------------------------------------*/
void adafruit_ble_task(void* arg)
{
  (void) arg;

  uint8_t * ev_buf = (uint8_t*) rtos_malloc(BLE_EVT_LEN_MAX(BLE_GATT_ATT_MTU_MAX));

  while (1)
  {
    if ( xSemaphoreTake(Bluefruit._ble_event_sem, portMAX_DELAY) )
    {
      uint32_t err = ERROR_NONE;

      // Until no pending events
      while( NRF_ERROR_NOT_FOUND != err )
      {
        uint16_t ev_len = BLE_EVT_LEN_MAX(BLE_GATT_ATT_MTU_MAX);

        // Get BLE Event
        err = sd_ble_evt_get(ev_buf, &ev_len);

        // Handle valid event, ignore error
        if( ERROR_NONE == err)
        {
          Bluefruit._ble_handler( (ble_evt_t*) ev_buf );
        }
      }
    }
  }
}

/**
 * BLE event handler
 * @param evt event
 */
void AdafruitBluefruit::_ble_handler(ble_evt_t* evt)
{
  // conn handle has fixed offset for all events
  uint16_t const conn_hdl = evt->evt.common_evt.conn_handle;

  LOG_LV1("BLE", "%s : Conn Handle = %d", dbg_ble_event_str(evt->header.evt_id), conn_hdl);

  // GAP handler
  Gap._eventHandler(evt);
  Advertising._eventHandler(evt);
  Scanner._eventHandler(evt);

  Periph._eventHandler(evt);

  /*------------- BLE Peripheral Events -------------*/
  /* Only handle Peripheral events with matched connection handle
   * or a few special one
   * - Connected event
   * - Advertising timeout (could be connected and advertising at the same time)
   *
   * Pairing procedure
   * - Connect -> SEC_PARAMS_REQUEST -> CONN_SEC_UPDATE -> AUTH_STATUS
   *
   * Reconnect to a paired device
   * - Connect -> SEC_INFO_REQUEST -> CONN_SEC_UPDATE
   */
  if ( conn_hdl       == _conn_hdl             ||
       evt->header.evt_id == BLE_GAP_EVT_CONNECTED ||
       evt->header.evt_id == BLE_GAP_EVT_TIMEOUT )
  {
    switch ( evt->header.evt_id  )
    {
      case BLE_GAP_EVT_CONNECTED:
      {
        ble_gap_evt_connected_t* para = &evt->evt.gap_evt.params.connected;

        if (para->role == BLE_GAP_ROLE_PERIPH)
        {
          _conn_hdl      = evt->evt.gap_evt.conn_handle;
        }
      }
      break;

      case BLE_GAP_EVT_DISCONNECTED:
        _conn_hdl = BLE_CONN_HANDLE_INVALID;
      break;

      case BLE_GATTS_EVT_SYS_ATTR_MISSING:
        sd_ble_gatts_sys_attr_set(_conn_hdl, NULL, 0, 0);
      break;

      default: break;
    }
  }

  // Central Event Handler
  if (_central_count)
  {
    // Skip if not central connection
    if (conn_hdl != _conn_hdl ||
        conn_hdl == BLE_CONN_HANDLE_INVALID)
    {
      Central._eventHandler(evt);
    }
  }

  // Discovery Event Handler
  if ( Discovery.begun() ) Discovery._eventHandler(evt);

  // GATTs characteristics event handler
  Gatt._eventHandler(evt);

  // User callback if set
  if (_event_cb) _event_cb(evt);
}

/*------------------------------------------------------------------*/
/* Internal Connection LED
 *------------------------------------------------------------------*/
void AdafruitBluefruit::_startConnLed(void)
{
  if (_led_conn) xTimerStart(_led_blink_th, 0);
}

void AdafruitBluefruit::_stopConnLed(void)
{
  xTimerStop(_led_blink_th, 0);
}

void AdafruitBluefruit::_setConnLed (bool on_off)
{
  if (_led_conn)
  {
    digitalWrite(LED_BLUE, on_off ? LED_STATE_ON : (1-LED_STATE_ON) );
  }
}

/*------------------------------------------------------------------*/
/* Bonds
 *------------------------------------------------------------------*/
bool AdafruitBluefruit::requestPairing(uint16_t conn_hdl)
{
  BLEConnection* conn = Gap.Connection(conn_hdl);
  VERIFY(conn);

  return conn->requestPairing();
}

void AdafruitBluefruit::clearBonds(void)
{
  bond_clear_prph();
}

//--------------------------------------------------------------------+
//
//--------------------------------------------------------------------+

void Bluefruit_printInfo(void)
{
  Bluefruit.printInfo();
}

void AdafruitBluefruit::printInfo(void)
{
  // Skip if Serial is not initialised
  if ( !Serial ) return;

  // Skip if Bluefruit.begin() is not called
  if ( _ble_event_sem == NULL ) return;

  Serial.println("--------- SoftDevice Config ---------");

  char const * title_fmt = "%-16s: ";

  /*------------- SoftDevice Config -------------*/
  // Max uuid128
  Serial.printf(title_fmt, "Max UUID128");
  Serial.println(_sd_cfg.uuid128_max);

  // ATTR Table Size
  Serial.printf(title_fmt, "ATTR Table Size");
  Serial.println(_sd_cfg.attr_table_size);

  // Service Changed
  Serial.printf(title_fmt, "Service Changed");
  Serial.println(_sd_cfg.service_changed);

  if ( _prph_count )
  {
    Serial.println("Peripheral Connect Setting");

    Serial.print("  - ");
    Serial.printf(title_fmt, "Max MTU");
    Serial.println(Gap._prph.mtu_max);

    Serial.print("  - ");
    Serial.printf(title_fmt, "Event Length");
    Serial.println(Gap._prph.event_len);

    Serial.print("  - ");
    Serial.printf(title_fmt, "HVN Queue Size");
    Serial.println(Gap._prph.hvn_qsize);

    Serial.print("  - ");
    Serial.printf(title_fmt, "WrCmd Queue Size");
    Serial.println(Gap._prph.wrcmd_qsize);
  }

  if ( _central_count )
  {
    Serial.println("Central Connect Setting");

    Serial.print("  - ");
    Serial.printf(title_fmt, "Max MTU");
    Serial.println(Gap._central.mtu_max);

    Serial.print("  - ");
    Serial.printf(title_fmt, "Event Length");
    Serial.println(Gap._central.event_len);

    Serial.print("  - ");
    Serial.printf(title_fmt, "HVN Queue Size");
    Serial.println(Gap._central.hvn_qsize);

    Serial.print("  - ");
    Serial.printf(title_fmt, "WrCmd Queue Size");
    Serial.println(Gap._central.wrcmd_qsize);
  }

  /*------------- Settings -------------*/
  Serial.println("\n--------- BLE Settings ---------");
  // Name
  Serial.printf(title_fmt, "Name");
  {
    char name[32];
    memclr(name, sizeof(name));
    getName(name, sizeof(name));
    Serial.printf(name);
  }
  Serial.println();

  // Max Connections
  Serial.printf(title_fmt, "Max Connections");
  Serial.printf("Peripheral = %d, ", _prph_count);
  Serial.printf("Central = %d ", _central_count);
  Serial.println();

  // Address
  Serial.printf(title_fmt, "Address");
  {
    char const * type_str[] = { "Public", "Static", "Private Resolvable", "Private Non Resolvable" };
    uint8_t mac[6];
    uint8_t type = Gap.getAddr(mac);

    // MAC is in little endian --> print reverse
    Serial.printBufferReverse(mac, 6, ':');
    Serial.printf(" (%s)", type_str[type]);
  }
  Serial.println();

  // Tx Power
  Serial.printf(title_fmt, "TX Power");
  Serial.printf("%d dBm", _tx_power);
  Serial.println();

  Periph.printInfo();

  /*------------- List the paried device -------------*/
  if ( _prph_count )
  {
    Serial.printf(title_fmt, "Peripheral Paired Devices");
    Serial.println();
    bond_print_list(BLE_GAP_ROLE_PERIPH);
  }

  if ( _central_count )
  {
    Serial.printf(title_fmt, "Central Paired Devices");
    Serial.println();
    bond_print_list(BLE_GAP_ROLE_CENTRAL);
  }

  Serial.println();
}
